Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИдентификаторыТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4380d8c9-cbf4-44cf-b7c9-1da41ff5be61">
    <name>гкс_Обслуживание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67f4d7dd-7bf2-4031-a04a-7940d981637a">
    <name>гкс_Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВерсииТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_ИдентификаторыТехКарт/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    #Вставка
	// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
	Если Параметры.Свойство("ВремяНачалаОткрытияФормы") Тогда
		ВремяНачалаЗамера = Параметры.ВремяНачалаОткрытияФормы;		
	КонецЕсли; 
	// } Гкс-[TOIR20-622]
	#КонецВставки
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("УстановитьСвойствоЭлементовФормыОтПрав", Истина));

	// >> [Деснол] [Ушаков А.Д.] [23.10.2019]
	дс_УстановитьЗаголовкиЭлементов();
	// << [Деснол] [Ушаков А.Д.] [23.10.2019] 
	#Вставка
	ДополнитьФормуЭлементами();
	#КонецВставки 
КонецПроцедуры

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	гкс_ПриОткрытииПослеНаСервере(ВремяНачалаЗамера);
КонецПроцедуры // } Гкс-[TOIR20-622]

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура гкс_ПриОткрытииПослеНаСервере(ВремяНачалаЗамера)
	ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера);	
КонецПроцедуры // } Гкс-[TOIR20-622]

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// Гкс+[TOIR20-109] Селимов от 02.06.2020. Добавлено:{
&НаКлиенте
Процедура гкс_ОткрытьИсториюДанныхВместо(Команда)

	ИдентификаторТехКарты = Элементы.Список.ТекущиеДанные.Ссылка;
	ТехнологическаяКарта = ТехКартаПоИдентификатору(ИдентификаторТехКарты);
	Если ЗначениеЗаполнено(ТехнологическаяКарта) Тогда
		// гкс+ [03.23] Деснол 13.03.2023
		//Отбор = Новый Структура("Data", ТехнологическаяКарта); 				
		//ОткрытьФорму("sysForm:DataHistoryVersions", Отбор, ЭтаФорма, , , , ,
		//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", ТехнологическаяКарта);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		
		ОткрытьФорму("РегистрСведений.ВерсииОбъектов.Форма.ВыборХранимыхВерсий",
								ПараметрыФормы,);
		// гкс- [03.23] Деснол 13.03.2023
	КонецЕсли; 

КонецПроцедуры // } Гкс-[TOIR20-109] 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Гкс+[TOIR20-109] Селимов от 02.06.2020. Добавлено:{
&НаСервере
Функция ТехКартаПоИдентификатору(ИдентификаторТехКарты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
		|ИЗ
		|	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних КАК торо_ВерсииТехКартСрезПоследних
		|ГДЕ
		|	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты = &ИдентификаторТехКарты";
	
	Запрос.УстановитьПараметр("ИдентификаторТехКарты", ИдентификаторТехКарты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ТехКарта;	
	
КонецФункции // } Гкс-[TOIR20-109] 

// Гкс+[TOIR20-116] Селимов от 04.06.2020. Добавлено:{
&НаСервере
Процедура ДополнитьФормуЭлементами()
	
	// Создадим команду
    Команда		= ЭтаФорма.Команды.Добавить("ОткрытьИсториюДанных");
    Команда.Действие	= "гкс_ОткрытьИсториюДанныхВместо";

    // Создадим кнопку и привяжем к ней команду
    Кнопка		= ЭтаФорма.Элементы.Добавить(Команда, Тип("КнопкаФормы"), ЭтаФорма.Элементы.ФормаКоманднаяПанель);
    Кнопка.Заголовок	= "История изменений";
    Кнопка.ИмяКоманды	= "ОткрытьИсториюДанных";
	Кнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	Кнопка.Картинка		= БиблиотекаКартинок.ИсторияДанных;
	
	Элементы.Переместить(Кнопка, Элементы.ФормаКоманднаяПанель, Элементы.ДополнениеСтрокаПоиска); 
	
КонецПроцедуры // } Гкс-[TOIR20-116] 

// Гкс+[TOIR20-622] Оселедько В.С. от 25.07.2025. Добавлено:{
&НаСервереБезКонтекста
Процедура ЗавершитьЗамерОткрытияФормы(ВремяНачалаЗамера)
	
    ОценкаПроизводительности.ЗакончитьЗамерВремени("Справочник.торо_ИдентификаторыТехКарт.ОткрытиеФормыСписка", ВремяНачалаЗамера); 
	
КонецПроцедуры // } Гкс-[TOIR20-622]

#КонецОбласти
